CassiniSea/lcd-st7735-stm8s/main.c
void UI_DrawNumber(
    uint8_t x,
    uint8_t y,
    uint16_t value,
    uint16_t color,
    uint16_t bg_color
)
{
    uint8_t digits_count;
    uint8_t digit;
    uint8_t position;
    uint16_t divisor;

    if (value >= 10000)
    {
        digits_count = 5;
    }
    else if (value >= 1000)
    {
        digits_count = 4;
    }
    else if (value >= 100)
    {
        digits_count = 3;
    }
    else if (value >= 10)
    {
        digits_count = 2;
    }
    else
    {
        digits_count = 1;
    }

    /*
     * Всегда выводим поле из 5 символов.
     * Ведущие позиции просто заливаем фоном.
     */
    for (position = 0; position < 5; position++)
    {
        if (position < (5 - digits_count))
        {
            ST7735_FillRect(
                x + position * 6,
                y,
                FONT_WIDTH,
                FONT_HEIGHT,
                bg_color
            );
        }
        else
        {
            divisor = 1;

            for (digit = 1; digit < (digits_count - (position - (5 - digits_count))); digit++)
            {
                divisor *= 10;
            }

            digit = value / divisor;
            value %= divisor;

            ST7735_DrawBitmap(
                x + position * 6,
                y,
                digits[digit],
                FONT_WIDTH,
                FONT_HEIGHT,
                color,
                bg_color
            );
        }
    }
}

void UI_DrawVariable(uint8_t variableIndex) {
	VariableSettings_TypeDef variableSettings = variablesSettings[variableIndex];
	
	UI_DrawText(
    variableSettings.x,
    variableSettings.y,
    variableSettings.label,
    variableSettings.label_len,
    UI_TEXT_COLOR,
    UI_TEXT_BG_COLOR
	);
	
	UI_DrawNumber(
    variableSettings.x + variableSettings.valueIndent,
    variableSettings.y,
    variablesValues[variableIndex],
    UI_TEXT_COLOR,
    UI_TEXT_BG_COLOR
	);
}

void UI_DrawVariables(void) {
	uint8_t variableIndex;
	
	for (variableIndex = 0; variableIndex < VARIABLES_NUMBER; variableIndex++) {
		UI_DrawVariable(variableIndex);		
	}
}

void UI_DrawMarker(void) {
	uint8_t variableIndex;
	uint8_t markerPosition;
	uint16_t color;
	VariableSettings_TypeDef variableSettings;
	
	for (variableIndex = 0; variableIndex < VARIABLES_NUMBER; variableIndex++) {
		if(variableIndex == selected_variable && ui_mode == UI_MODE_SELECT)
			color = UI_MARKER_COLOR;
		else 
			color = UI_PANEL_COLOR;
		
		variableSettings = variablesSettings[variableIndex];
		
		ST7735_FillRect(
			variableSettings.x - 5,
			variableSettings.y + 2,
			2,
			3,
			color
		);
		
		
		for (markerPosition = 0; markerPosition < VARIABLE_MAX_DIGITS; markerPosition++) {
			if(variableIndex == selected_variable && markerPosition == selected_digit && ui_mode == UI_MODE_EDIT)
				color = UI_MARKER_COLOR;
			else
				color = UI_PANEL_COLOR;
				
			ST7735_FillRect(
				variableSettings.x + variableSettings.valueIndent + (FONT_WIDTH + 1) * markerPosition + 1,
				variableSettings.y + FONT_HEIGHT,
				3,
				2,
				color
			);			
		}
	}
}

void variablesInit(void) {
	uint8_t variableIndex;
	
	for (variableIndex = 0; variableIndex < VARIABLES_NUMBER; variableIndex++) {
		variablesValues[variableIndex] = eepromReadU16(
			EEPROM_DEFAULT_ADDR + 2 * variableIndex,
			0
		);
	}	
}

void graphPushValue(uint8_t newValue, uint8_t newPowerValue) {
    uint8_t i;
		
		graphGuidePosition++;			
		if (graphGuidePosition >= UI_GRAPH_GUIDE_INTERVAL)
			graphGuidePosition = 0;

    // Идем с конца массива к началу
    // Элемент [i] принимает значение элемента [i - 1]
    for (i = UI_GRAPH_WIDTH - 1; i > 0; i--) {
			graphTemperatureValues[i] = graphTemperatureValues[i - 1];
			graphPowerValues[i] = graphPowerValues[i - 1];
    }

    // Записываем новое значение в самый первый элемент
    graphTemperatureValues[0] = newValue;
		graphPowerValues[0] = newPowerValue;
}

uint8_t graphScaledTemperatureValue(float graphValue) {
	float relativeValue;
	
	// Ограничиваем входное значение жестко рамками [200 ... 350]
  if (graphValue > UI_GRAPH_MAX_TEMP) graphValue = UI_GRAPH_MAX_TEMP;
  if (graphValue < UI_GRAPH_MIN_TEMP) graphValue = UI_GRAPH_MIN_TEMP;
	
	// Вычитаем минимальную температуру, чтобы график начинался от UI_GRAPH_MIN_TEMP
	relativeValue = graphValue - (float)UI_GRAPH_MIN_TEMP;
	
	return UI_GRAPH_HEIGHT - (uint8_t)(relativeValue * UI_GRAPH_HEIGHT_SCALE);
}

uint8_t graphScaledPowerValue(uint16_t graphPowerValue) {
	return UI_GRAPH_HEIGHT - (uint8_t)((UI_GRAPH_HEIGHT - 2) * (float)graphPowerValue / HEATER_PWM_PERIOD_MAX) - 1;
}

void updateHeaterPwmFiltered(uint16_t currentValue) {
	int32_t innovation;
	// Первая инициализация при старте, чтобы фильтр не «разгонялся» с нуля
	if (heaterPwmFiltered == 0) {
			heaterPwmFiltered = (uint32_t)currentValue << 8; // Умножаем на 256 сдвигом
			return;
	}
	
	// Формула Калмана / EMA в целых числах:
	// Новое состояние = Старое состояние + (Новое значение * 256 - Старое состояние) * (GAIN / 256)
	// Чтобы не делить на 256, в конце делаем сдвиг >> 8
	innovation = ((int32_t)currentValue << 8) - heaterPwmFiltered;
	heaterPwmFiltered = heaterPwmFiltered + ((innovation * HEATER_PWM_FILTER_GAIN) >> 8);
}

uint16_t getHeaterPwmFiltered(void) {
	// Возвращаем реальное отфильтрованное значение uint16_t
	return (uint16_t)(heaterPwmFiltered >> 8);
}

VerticalGuidePosition_TypeDef getVerticalGuidePosition(void) {
	static VerticalGuidePosition_TypeDef verticalGuidePosition = {0, 0};
	uint16_t tempValue = variablesValues[VARIABLE_TEMP];
	
	if(tempValue > UI_GRAPH_MAX_TEMP)
		tempValue = UI_GRAPH_MAX_TEMP;
	
	verticalGuidePosition.prev = verticalGuidePosition.current;
	verticalGuidePosition.current = graphScaledTemperatureValue(tempValue);
	
	return verticalGuidePosition;
}

void drawGraphSegment(const uint8_t* graphArray, uint8_t index, uint16_t color) {
	ST7735_FillRectByCoordinates(
		UI_GRAPH_WIDTH - index,
		graphArray[index+1],
		UI_GRAPH_WIDTH - index,
		graphArray[index+2],
		ST7735_BLACK
	);
	
	if(graphArray[index] > 0 && graphArray[index] < UI_GRAPH_HEIGHT && graphArray[index+1] > 0 && graphArray[index+1] < UI_GRAPH_HEIGHT) {				
		ST7735_FillRectByCoordinates(
			UI_GRAPH_WIDTH - index,
			graphArray[index],
			UI_GRAPH_WIDTH - index,
			graphArray[index+1],
			color
		);
	}
}

